# Вычислить число c заданной точностью d

d = int(input('Введите точность: '))
print(round(1/3, d))
